[
  "If it had not rained on a certain May morning her whole life would have been entirely different.",
  "She wakened early, in the lifeless, hopeless hour just preceding dawn. She had not slept very well. One does not sleep well, sometimes, when one is twenty-nine on the morrow, and unmarried, in a community and connection where the unmarried are simply those who have failed to get a man.",
  "They had long since relegated her to hopeless old maidenhood.",
  "But she herself had never quite relinquished a certain pitiful, shamed, little hope that Romance would come her way yet—never, until this wet, horrible morning, when she wakened to the fact that she was twenty-nine and unsought by any man.",
  "Ay, there lay the sting. She did not mind so much being an old maid. After all, she thought, being an old maid couldn’t possibly be as dreadful as being married to an Uncle Wellington or an Uncle Benjamin, or even an Uncle Herbert. What hurt her was that she had never had a chance to be anything but an old maid. No man had ever desired her.",
  "The tears came into her eyes as she lay there alone in the faintly greying darkness. She dared not let herself cry as hard as she wanted to, for two reasons. She was afraid that crying might bring on another attack of that pain around the heart. She had had a spell of it after she had got into bed—rather worse than any she had had yet. And she was afraid her mother would notice her red eyes at breakfast and keep at her with minute, persistent, mosquito-like questions regarding the cause thereof.",
  "“Suppose,” she thought with a ghastly grin, “I answered with the plain truth, ‘I am crying because I cannot get married.’ How horrified Mother would be—though she is ashamed every day of her life of her old maid daughter.”",
  "But of course appearances should be kept up. “It is not,” Valancy could hear her mother’s prim, dictatorial voice asserting, “it is not maidenly to think about men.”",
  "The thought of her mother’s expression made her laugh—for she had a sense of humour nobody in her clan suspected. For that matter, there were a good many things about her that nobody suspected. But presently she lay there, a huddled, futile little figure, listening to the rain pouring down outside and watching, with a sick distaste, the chill, merciless light creeping into her ugly, sordid room.",
  "She knew the ugliness of that room by heart—knew it and hated it. The yellow-painted floor, with one hideous, “hooked” rug by the bed, with a grotesque, “hooked” dog on it, always grinning at her when she awoke; the faded, dark-red paper; the ceiling discoloured by old leaks and crossed by cracks; the narrow, pinched little washstand; the brown-paper lambrequin with purple roses on it; the spotted old looking-glass with the crack across it, propped up on the inadequate dressing-table; the jar of ancient potpourri made by her mother in her mythical honeymoon; the shell-covered box, with one burst corner, which Cousin Stickles had made in her equally mythical girlhood; the beaded pincushion with half its bead fringe gone; the one stiff, yellow chair; the faded old motto, “Gone but not forgotten,” worked in coloured yarns about Great-grand-mother Stirling’s grim old face; the old photographs of ancient relatives long banished from the rooms below.",
  "There were only two pictures that were not of relatives. One, an old chromo of a puppy sitting on a rainy doorstep. That picture always made Valancy unhappy. That forlorn little dog crouched on the doorstep in the driving rain! Why didn’t some one open the door and let him in?",
  "But she never dared destroy it or remove it.",
  "Every room in the house was ugly, of course.",
  "There was no money for rooms nobody ever saw.",
  "Valancy never persisted. She was afraid to.",
  "Her mother could not brook opposition. Mrs. Stirling would sulk for days if offended, with the airs of an insulted duchess.",
  "The only thing Valancy liked about her room was that she could be alone there at night to cry if she wanted to.",
  "But, after all, what did it matter if a room, which you used for nothing except sleeping and dressing in, were ugly?",
  "People who wanted to be alone, so they believed, could only want to be alone for some sinister purpose.",
  "She had lived spiritually in the Blue Castle ever since she could remember. She had been a very tiny child when she found herself possessed of it.",
  "All that supported her through the boredom of her days was the hope of going on a dream spree at night.",
  "Most, if not all, of the family would have died of horror if they had known half the things she did in her Blue Castle.",
  "I don’t say she deliberately murdered these lovers as she outgrew them.",
  "One simply faded away as another came.",
  "Reality pressed on her too hardly, barking at her heels like a maddening little dog.",
  "She was twenty-nine, lonely, undesired, ill-favoured—the only homely girl in a handsome clan, with no past and no future.",
  "As far as she could look back, life was drab and colourless, with not one single crimson or purple spot anywhere. As far as she could look forward it seemed certain to be just the same until she was nothing but a solitary, little withered leaf clinging to a wintry bough.",
  "The moment when a woman realises that she has nothing to live for—neither love, duty, purpose nor hope—holds for her the bitterness of death.",
  "“And I just have to go on living because I can’t stop. I may have to live eighty years,” she thought, in a kind of panic.",
  "“We’re all horribly long-lived. It sickens me to think of it.”",
  "Much as she hated going to the picnic, it would never have occurred to her to rebel against it.",
  "Aunt Alberta, enormously fat, with an amiable habit of always referring to her husband as “he,” as if he were the only male creature in the world, never let you forget that she had been a great beauty in her youth.",
  "She had been poor all her life and knew the galling bitterness of it.",
  "So she endured his riddles and even smiled tortured little smiles over them.",
  "Aunt Isabel prided herself on saying what she thought, but didn’t like it so well when other people said what they thought to her.",
  "She felt vaguely that if she had come across these books years ago life might have been a different thing for her.",
  "They seemed to her to yield glimpses of a world into which she might once have entered, though the door was forever barred to her now.",
  "“Where does he live?” Valancy had asked.",
  "“Nobody knows. From his books he must be a Canadian, but no more information can be had. His publishers won’t say a word. Quite likely John Foster is a nom de plume. His books are so popular we can’t keep them in at all, though I really can’t see what people find in them to rave over.”",
  "“I think they’re wonderful,” she said, timidly.",
  "She could hardly say what it was—some tantalising lure of a mystery never revealed—some hint of a great secret just a little further on—some faint, elusive echo of lovely, forgotten things—his magic was indefinable.",
  "She did not want any one to know about her heart.",
  "She felt that she couldn’t tell anybody unless she had to.",
  "She felt quite sure there was nothing at all seriously wrong with her heart and no need of all the bother that would ensue if she mentioned it.",
  "The doctor was a gruff, outspoken, absent-minded old fellow, but he was a recognised authority on heart disease, even if he were only a general practitioner in out-of-the-world Deerwood.",
  "None of the family had ever gone to him since he had told Cousin Gladys, ten years before, that her neuritis was all imaginary and that she enjoyed it.",
  "You couldn’t patronise a doctor who insulted you like that—not to mention that he was a Presbyterian.",
  "But she, between the devil of disloyalty to clan and the deep sea of fuss and clatter and advice, thought she would take a chance with the devil."
]
